/*
 * filter.h
 *
 *  Created on: 23 апреля 2017 г.
 *      Author: klen
 */

#ifndef __FILTER_H__
#define __FILTER_H__

#include "vdt/sincos.h"
#include "vdt/hyperbolic.h"

/*
   простейший alfa-фильтр
*/

template <typename T, typename V> class alfa_filter_t
{
  public:
    alfa_filter_t (): y(0) {}

    void tau( const V Ts , const V t )
    {
      a1 = Ts / t ;
      a0 = 1.0 - a1 ;
    }

    V tau( const V Ts)
    {
      return Ts / a1 ;
    }

    const T& update ( const T& x )
    {
      y = a0*y + a1*x ;
      return y ;
    }

    V a0 ;  // alfa
    V a1 ;  // 1 - alfa
    T y ; // выход фильтра
} ;

/*
http://model.exponenta.ru/lectures/audio_eq.htm
Цифровые фильтры второго порядка с бесконечной импульсной характеристикой

1. Передаточную функцию (ПФ) для дискретного фильтра любого типа можно получить
из ПФ  аналогового  прототипа  посредствам Билинейного преобразования (БЛП).
Одновременно  БЛП  может  быть  использовано  для масштабирующих операций в
частотном домене. В частности для смещения полосы пропускания и регулировки
ее ширины.

Дискретная ПФ фильтра второго порядка имеет вид:

            b0 + b1*z^-1 + b2*z^-2
    H(z) = ------------------------                                (1)
            a0 + a1*z^-1 + a2*z^-2

Для сокращения нагрузки на ЦВМ шесть коэффициентов z-ПФ могут быть заменены
эквивалентными, один из которых будет равен единице (одна из шести операций
умножения будет сокращена). Если проектируемая z-ПФ лишь одна из нескольких
включенных последовательно, то можно привести к единице еще один коэффициент,
за счет коррекции общего коэффициента передачи цепочки фильтров или системы.
Тогда z-ПФ будет иметь вид:

            (b0/a0) + (b1/a0)*z^-1 + (b2/a0)*z^-2
    H(z) = ---------------------------------------                 (2)
               1 + (a1/a0)*z^-1 + (a2/a0)*z^-2

или

                      1 + (b1/b0)*z^-1 + (b2/b0)*z^-2
    H(z) = (b0/a0) * ---------------------------------             (3)
                      1 + (a1/a0)*z^-1 + (a2/a0)*z^-2

Дальнейшее  сокращение  операций  умножения  возможно, если z-ПФ имеет пары
равных коэффициентов.
Рекуррентный  алгоритм,  реализующий z-ПФ (2),  должен рассчитывать следующее
разностное уравнение (РУ):



    y[n] = (b0/a0)*x[n] + (b1/a0)*x[n-1] + (b2/a0)*x[n-2]
                        - (a1/a0)*y[n-1] - (a2/a0)*y[n-2]          (4)


2. Параметры цифровых фильтров

1/dT = sampleRate
    Частота дискретизации фильтра. Определяется как обратная величина от
    периода времени dT, через который цифровая вычислительная машина способна
    выполнять подпрограмму, рассчитывающую соответствующее разностное уравнение (4)
Частота (frequency)
    В зависимости от типа фильтра – это "частота сопряжения" (оценивается по
    пересечению ЛАЧХ с уровнем -3 дБ), "резонансная частота" для полосового и
    режекторного фильтров, "центральная частота" полософормирующего фильтра,
    или "центральна частота наклонного участка" фильтра-ступени (фильтра-горки)
К в полосе (dBgain)
    Коэффициент передачи на модифицируемом участке ЛАЧХ для полософормирующего
    фильтра и фильтра-ступени
Добротность (Q)
    Отношение резонансной частоты фильтра к ширине его полосы. В зависимости от
    типа фильтра при формировании требований к ЧХ, бывает удобней пользоваться
    эквивалентными параметрами – "полосой" и "наклоном"
Полоса (bandwidth)
    Ширина полосы рабочих частот фильтра. Для полосового и режекторного фильтров
    оценивается по пересечению их ЛАЧХ с уровнем -3 дБ. Для полософормирующего
    фильтра – по пересечению их ЛАЧХ с её средним уровнем (dBgain/2).
    Для фильтра-ступени – это длина наклонного участка
Наклон (shelf slope)
    Модуль наклона ЛАЧХ фильтра-ступени. Максимально возможный наклон (без появления
    колебательности ЛАЧХ) равен 1 Белу за октаву. При задании малого значения наклона
    фильтр-ступень превращается в фильтр-лестницу (ЛАЧХ похожа на две ступеньки).
    Наклонный участок становится нелинейным


3. Вычисление коэффициентов цифровых фильтров

Аналоговые прототипы разрабатываются для приведенной (нормализованной) частоты.
Данные прототипы, при оптимальной настройке, являются фильтрами Баттерворта
(с максимально плоскими ЛАЧХ). Билинейное преобразование выполняется посредствам
подстановки:

                1          1 - z^-1
   s  =  -------------- * ----------
          tan(omega/2)     1 + z^-1

Для вычисления тангенса при составлении программы используются тригонометрические тождества:

                 sin(w)                                 1 - cos(w)
   tan(w/2) = ------------              (tan(w/2))^2 = ------------
               1 + cos(w)                               1 + cos(w)


4. Расчет промежуточных переменных

A     = sqrt[ 10^(dBgain/20) ] =
      = 10^(dBgain/40)                    (только для полософормирующих фильтров)

omega = 2*pi*frequency/sampleRate

sin   = sin(omega)
cos   = cos(omega)


alpha = sin/(2*Q) =                                    (если задана Q)
      = sin*sinh[ ln(2)/2 * bandwidth * omega/sin ]    (если задана полоса)

    Отношение между шириной полосы и Q:
            1/Q = 2*sinh[ln(2)/2*bandwidth*omega/sin]  (для ЦФ на основе БЛП)
    or      1/Q = 2*sinh[ln(2)/2*bandwidth]            (для аналогового прототипа)


beta  = sqrt(A)/Q =                                    (только для фильтров-ступенек)
      = sqrt(A)*sqrt[ (A + 1/A)*(1/S - 1) + 2 ]        (если задан наклон горки)
      = sqrt[ (A^2 + 1)/S - (A-1)^2 ]

    Отношение между наклоном и Q:
            1/Q = sqrt[(A + 1/A)*(1/S - 1) + 2

5. Расчет коэф. фильтров
ФНЧ:    H(s) = 1 / (s^2 + s/Q + 1)

        b0 =  (1 - cos)/2
        b1 =   1 - cos
        b2 =  (1 - cos)/2
        a0 =   1 + alpha
        a1 =  -2*cos
        a2 =   1 - alpha


ФВЧ:    H(s) = s^2 / (s^2 + s/Q + 1)

        b0 =  (1 + cos)/2
        b1 = -(1 + cos)
        b2 =  (1 + cos)/2
        a0 =   1 + alpha
        a1 =  -2*cos
        a2 =   1 - alpha


ПФ:     H(s) = s / (s^2 + s/Q + 1)          (пик АЧХ = Q)

        b0 =   sin/2  =   Q*alpha
        b1 =   0
        b2 =  -sin/2  =  -Q*alpha
        a0 =   1 + alpha
        a1 =  -2*cos
        a2 =   1 - alpha


ПФ:     H(s) = (s/Q) / (s^2 + s/Q + 1)      (пик АЧХ = 0 dB)

        b0 =   alpha
        b1 =   0
        b2 =  -alpha
        a0 =   1 + alpha
        a1 =  -2*cos
        a2 =   1 - alpha


Режекторный фильтр или фильтр - пробка:
        H(s) = (s^2 + 1) / (s^2 + s/Q + 1)

        b0 =   1
        b1 =  -2*cos
        b2 =   1
        a0 =   1 + alpha
        a1 =  -2*cos
        a2 =   1 - alpha


Фазовращающий фильтр:
        H(s) = (s^2 - s/Q + 1) / (s^2 + s/Q + 1)

        b0 =   1 - alpha
        b1 =  -2*cos
        b2 =   1 + alpha
        a0 =   1 + alpha
        a1 =  -2*cos
        a2 =   1 - alpha


Полософормирующий фильтр (для эквалайзеров):
        H(s) = (s^2 + s*(A/Q) + 1) / (s^2 + s/(A*Q) + 1)

        b0 =   1 + alpha*A
        b1 =  -2*cos
        b2 =   1 - alpha*A
        a0 =   1 + alpha/A
        a1 =  -2*cos
        a2 =   1 - alpha/A


Фильтр - НЧ-ступень-лестница:
        H(s) = A * (s^2 + (sqrt(A)/Q)*s + A) / (A*s^2 + (sqrt(A)/Q)*s + 1)

        b0 =    A*[ (A+1) - (A-1)*cos + beta*sin ]
        b1 =  2*A*[ (A-1) - (A+1)*cos            ]
        b2 =    A*[ (A+1) - (A-1)*cos - beta*sin ]
        a0 =        (A+1) + (A-1)*cos + beta*sin
        a1 =   -2*[ (A-1) + (A+1)*cos            ]
        a2 =        (A+1) + (A-1)*cos - beta*sin


Фильтр - ВЧ-ступень-лестница:
        H(s) = A * (A*s^2 + (sqrt(A)/Q)*s + 1) / (s^2 + (sqrt(A)/Q)*s + A)

        b0 =    A*[ (A+1) + (A-1)*cos + beta*sin ]
        b1 = -2*A*[ (A-1) + (A+1)*cos            ]
        b2 =    A*[ (A+1) + (A-1)*cos - beta*sin ]
        a0 =        (A+1) - (A-1)*cos + beta*sin
        a1 =    2*[ (A-1) - (A+1)*cos            ]
        a2 =        (A+1) - (A-1)*cos - beta*sin
*/


template <typename T> class irr_second_order_filter_t
{
   public:

   typedef struct
   {
     T b0_a0 ;
     T b1_a0 ;
     T b2_a0 ;
     T a1_a0 ;
     T a2_a0 ;

     inline void reset() { b0_a0=b1_a0=b2_a0=a1_a0=a2_a0=0; }
   }
   k_t ;

   irr_second_order_filter_t() { k.reset(); }

   inline const T& update ( const T& x )
     {
       y[2]=y[1] ; y[1] = y[0] ;
       x[2]=x[1] ; x[1] = x[0] ;  x[0] = x ;
       y[0] = k.b0_a0*x[0] + k.b1_a0*x[1] + k.b2_a0*x[2] - k.a1_a0*y[1] - k.a2_a0*y[2] ;
       return y[0] ;
     }

   inline void reset()
     {
       x[0]=x[1]=x[2]=y[0]=y[1]=y[2]=0;
       k.reset();
     }

   inline void set(const k_t& k )
     {
       this->k = k ;
     }

   private:
     T y[3] ;
     T x[3] ;

     k_t k ;
};
/*
template <> class irr_second_order_filter_t<float>
{
   public:
     inline void low_pass(const T frequency , const T sample_rate, const T bandwidth, )
       {
           //  ФНЧ:    H(s) = 1 / (s^2 + s/Q + 1)
           T omega = vdt::details::VDT_2PI_F *frequency / sample_rate ;
           T cos , sin ;
           fast_sincosf( omega, sin, cos );

           T alpha = sin * dt::fast_sinhf( 0.3465736f * bandwidth * omega/sin );
           T cos = vdt::fast_cosf(omega) ;

           T a0 =   1 + alpha ;


           b0_a0 =  (1 - cos)/(2 * a0);
           b1_a0 =  (1 - cos)/a0 ;
           b2_a0 =  (1 - cos)/(2 * a0);

           a1_a0 =  (-2*cos)/a0 ;
           a2_a0 =  ( 1 - alpha)/a0 ;
       }
};
*/

#endif /* __FILTER_H__ */
